InformationRegisters/СобытияПоКонтрагентам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СобытияПоКонтрагентам</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСледующегоПосещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговыйПредставитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СобытияПоКонтрагентам/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Контрагент") И Не ЗначениеЗаполнено(ЭтотОбъект.Запись.Контрагент) Тогда
		ЭтотОбъект.Запись.Контрагент = Параметры.Контрагент;
	КонецЕсли;
	Если Параметры.Свойство("ТорговыйПредставитель") И Не ЗначениеЗаполнено(ЭтотОбъект.Запись.ТорговыйПредставитель) Тогда
		ЭтотОбъект.Запись.ТорговыйПредставитель = Параметры.ТорговыйПредставитель;
	КонецЕсли;
	Если Параметры.Свойство("Период") И Не ЗначениеЗаполнено(ЭтотОбъект.Запись.Период) Тогда
		ЭтотОбъект.Запись.Период = Параметры.Период;
	КонецЕсли;
	Если Параметры.Свойство("РежимОткрытия") И Параметры.РежимОткрытия = "ДляВводаЗначения" Тогда
		Элементы.Контрагент.ТолькоПросмотр = Истина;
		Элементы.ТорговыйПредставитель.ТолькоПросмотр = Истина;
		Элементы.Период.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Элементы.ДатаСледующегоПосещения.МинимальноеЗначение = КонецДня(ТекущаяДата()) + 1;
	Элементы.ДатаСледующегоПосещения.МаксимальноеЗначение = НачалоДня(ТекущаяДата()) + 31 * 86400;
	
	СписокДнейНедели = Новый Соответствие;
	СписокДнейНедели.Вставить(1, "Пн");	СписокДнейНедели.Вставить(2, "Вт");	СписокДнейНедели.Вставить(3, "Ср");
	СписокДнейНедели.Вставить(4, "Чт");	СписокДнейНедели.Вставить(5, "Пт");	СписокДнейНедели.Вставить(6, "Сб");	СписокДнейНедели.Вставить(7, "Вс");
	
	Если ЗначениеЗаполнено( Запись.ДатаСледующегоПосещения )  Тогда
		Всп = СписокДнейНедели.Получить( ДеньНедели( Запись.ДатаСледующегоПосещения ) );
		Элементы.ДекорацияДеньНедели.Заголовок = Всп;
	Иначе
		Элементы.ДекорацияДеньНедели.Заголовок = "";
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Всп = "";
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Запись.ДатаСледующегоПосещения < Элементы.ДатаСледующегоПосещения.МинимальноеЗначение Тогда
		Сообщить("Некорректная дата посещения");
		Отказ = Истина;
	ИначеЕсли Запись.ДатаСледующегоПосещения > Элементы.ДатаСледующегоПосещения.МаксимальноеЗначение Тогда
		Сообщить("Некорректная дата посещения");
		Отказ = Истина;
	Иначе
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаСледующегоПосещенияПриИзменении(Элемент)
	СписокДнейНедели = Новый Соответствие;
	СписокДнейНедели.Вставить(1, "Пн");	СписокДнейНедели.Вставить(2, "Вт");	СписокДнейНедели.Вставить(3, "Ср");
	СписокДнейНедели.Вставить(4, "Чт");	СписокДнейНедели.Вставить(5, "Пт");	СписокДнейНедели.Вставить(6, "Сб");	СписокДнейНедели.Вставить(7, "Вс");
	
	Если ЗначениеЗаполнено( Запись.ДатаСледующегоПосещения )  Тогда
		Всп = СписокДнейНедели.Получить( ДеньНедели( Запись.ДатаСледующегоПосещения ) );
		Элементы.ДекорацияДеньНедели.Заголовок = Всп;
	Иначе
		Элементы.ДекорацияДеньНедели.Заголовок = "";
	КонецЕсли; 
КонецПроцедуры
